cases/evaporatingFilm/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType hsTwophaseMixtureThermo<reactingMixture<gasThermoPhysics>>;

chemistryReader foamChemistryReader;

foamChemistryFile "$FOAM_CASE/constant/reactions";

foamChemistryThermoFile "$FOAM_CASE/constant/thermo";

// No mass diffusion before this time to let the phase interfaces relax
relaxTime  3e-5;

Vapor
{
   SchmidtNo  0.9;
   
   subspecies
   (
       N2 {}
       H2O {}
   );
}



Liquid
{
   SchmidtNo  0.9;
   
   subspecies
   (
        H2OL
        {
            transportModel  Newtonian;
            nu              nu [ 0 2 -1 0 0 0 0 ] 1e-6;
   
            rho0         rho0 [ 1 -3 0 0 0 0 0 ] 1000.0;
            Tc           Tc   [ 0 0 0 1 0 0 0]   647.1;
            kappa        kappa [1 1 -3 -1 0 0 0] 0.68;
            
            sigma0          sigma0 [ 1 0 -2 0 0 0 0] 0.13;
            sigmaa          1.0;
               
            evaporationModel HertzKnudsenPressure;
            
            HertzKnudsenPressureCoeffs
            {
               vapor           H2O;
               Lb              Lb [ 1 2 -2 0 -1 0 0] 40626000.0;
               Tb              Tb [ 0 0 0 1 0 0 0] 373.15;
               La              0.38;
               betaM           0.03;

               Tc              Tc [ 0 0 0 1 0 0 0] 647.3;
               Pc              Pc [ 1 -1 -2 0 0 0 0] 22120000;
               PvCoeffs        (10.9988 2.9728e3 4.1643e5);
            }
        }
   );
}




// ************************************************************************* //
