cases/evaporatingFilm/system/VOFSetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      VOFSetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

relaxPhases  on;
DTau         1e-10;

defaultSpecies
(
    N2   1.0
);

droplets
(
    WaterFilm
    {
        center   (-10 0.0005 0.0005);
        radius   (10.004 10.004 10.004);
        delVapor 1e-3;
        U        (0 0 0);
        liquidSpecies
        (
            H2OL  1.0
        );
        vaporSpecies
        (
            H2O   0.001
        );
    }
);


// ************************************************************************* //
